#### StructuralElementDefinitionData Members

---

|  |
| --- |
| StructuralElementDefinitionData Class   Constructors   Methods   Properties   See Also |

The  StructuralElementDefinitionData  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | StructuralElementDefinitionData | Creates empty StructuralElementDefinitionData object. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  StructuralElementDefinitionData |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CenterCurve | The curve lying in the geometrical center of the element. |
| Public property | Curve | The definition curve of the element. |
| Public property | EndShortening | Cutback or extension at element curve end. |
| Public property | IsMirrored | States if the structural section of the element is mirrored. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Normal | The local Z direction of the element section in the start point of the curve. |
| Public property | Section | Structural section of the element. |
| Public property | StartShortening | Cutback or extension at element curve start. |
| Public property | YJust | Y justification (ref axis). |
| Public property | YOffset | Y offset. |
| Public property | ZJust | Z justification (ref axis). |
| Public property | ZOffset | Z offset. |

# See Also

StructuralElementDefinitionData Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace